// На входе n – количество элементов массива, затем пользователь заполняет массив с клавиатуры.
// Используя метод map, вывести массив строк, определяющих четность или нечетность чисел.
// Входные: [1, 2, 3, 4, 5, 6] → Результат: ['нечет', 'чет', 'нечет', 'чет', 'нечет', 'чет']
// Входные: [1, 24, 5] → Результат: ['нечет', 'чет', 'нечет']
// Входные: [7, 8, 9] → Результат: ['нечет', 'чет', 'нечет]

const n = +prompt("enter");
const arr = [];
const newarr = [];

for (let i = 0; i < n; i++) {
  arr.push(+prompt("enter"));
}

const result = arr.map(function (el) {
  if (el % 2 == 0) {
    return "chet";
  } else {
    return "ne chet";
  }
});
console.log(result);
