// Сформируйте массив из 10 значений prompt. Выведите числа из массива, начинающиеся на 1, 2
// или 5.
// Метод: Используйте цикл for.
// Входные: [10, 20, 30, 50, 235, 3000] → Результат: [10, 20, 50, 235]
// Входные: [12, 22, 35, 51, 235, 102] → Результат: [12, 22, 51, 235, 102]
// Входные: [3, 4, 7, 8, 9] → Результат: []

const arr = [];
const newarr = [];
for (let i = 0; i < 10; i++) {
  arr.push(prompt("enter "));
}

for (let j = 0; j < arr.length; j++) {
  if (arr[j][0] === "1" || arr[j][0] === "2" || arr[j][0] === "5") {
    newarr.push(arr[j]);
  }
}
console.log(newarr);
